<div align="center">
  <p align="center">
    <a href="#">
      <img src="https://cdn.iconscout.com/icon/free/png-512/free-cisco-logo-icon-download-in-svg-png-gif-file-formats--anyconnect-brand-logos-pack-icons-1579764.png?f=webp&w=256" height="100px" />
    </a>
  </p>
</div>
<div style="border: 2px solid #d1d5db; padding: 20px; border-radius: 8px; background-color: #f9fafb;">
  <h1 align="center">Decouverte rÃ©seau chez CISCO</h1>
</div>

---
# Table des matiÃ¨res
- [Protocole propriÃ©taire: CDP](#decouverte_reseau.md#protocole-propri%C3%A9taire-cdp)
- [Protocole gÃ©nÃ©rique: LLDP](#decouverte_reseau.md#protocole-g%C3%A9n%C3%A9rique-lldp)

# Protocole propriÃ©taire: CDP
## Activation et dÃ©sactivation de CDP
- Par dÃ©faut, CDP est activÃ© sur les Ã©quipements Cisco. Cependant, il peut Ãªtre activÃ© ou dÃ©sactivÃ© globalement ou par interface.
 >âš ï¸ La bonne pratique est d dÃ©sactiver le protocole DCP pour qu'aucun attaquant ne puisse scanner le rÃ©seau Ã  la recherche d'information rÃ©seau.
### Activer/DÃ©sactiver CDP globalement
- Pour activer CDP globalement :
  ```ios
  Router(config)# cdp run
  ```
- Pour dÃ©sactiver CDP globalement :
  ```ios
  Router(config)# no cdp run
  ```
### Activer/DÃ©sactiver CDP sur une interface spÃ©cifique
- Pour activer CDP sur une interface :
  ```ios
  Router(config)# interface GigabitEthernet0/1
  Router(config-if)# cdp enable
  ```
- Pour dÃ©sactiver CDP sur une interface :
  ```ios
  Router(config)# interface GigabitEthernet0/1
  Router(config-if)# no cdp enable
  ```
## VÃ©rification des informations CDP
### Afficher les voisins CDP
- La commande suivante permet d'afficher les Ã©quipements voisins dÃ©tectÃ©s :
  ```ios
  Router# show cdp neighbors
  ```
- Cette commande affiche des informations telles que l'ID du pÃ©riphÃ©rique, le port local, le port distant et le type de plateforme.
  >ğŸ’¡ Capability Codes: 
  >R - Router, T - Trans Bridge, B - Source Route Bridge, S - Switch, H - Host, I - IGMP, r - Repeater, P - Phone, D - Remote, C - CVTA, M - Two-port Mac Relay
### Afficher les dÃ©tails des voisins CDP
- Pour obtenir des informations plus dÃ©taillÃ©es sur un voisin spÃ©cifique :
  ```ios
  Router# show cdp neighbors detail
  ```
>ğŸ’¡ Cette commande affiche des dÃ©tails supplÃ©mentaires comme l'adresse IP du voisin et le modÃ¨le du pÃ©riphÃ©rique.
- On peut filtrer les donnÃ©es affichÃ©es:
  - Afficher uniquement les adresses IP des voisins:
    ```ios
    Router# show cdp entry *
    ```
## Configuration avancÃ©e de CDP
- Le protocole communique de faÃ§on rÃ©guliÃ¨res les informations. Pour consulter ces informations:
  ```ios
  Router(config)# show cdp
  ```
### Modifier l'intervalle d'envoi des annonces CDP
- L'intervalle par dÃ©faut est de **60 secondes**, mais il peut Ãªtre modifiÃ© :
  ```ios
  Router(config)# cdp timer 30
  ```
  >ğŸ’¡ Cette commande ajuste l'intervalle Ã  30 secondes.
### Modifier le dÃ©lai avant suppression d'un voisin CDP
- L'intervalle par dÃ©faut est de **180 secondes**, mais il peut Ãªtre modifiÃ© :
  ```ios
  Router(config)# cdp holdtime 120
  ```
---
# Protocole gÃ©nÃ©rique: LLDP
## Activation et dÃ©sactivation de LLDP
- Par dÃ©faut, LLDP est dÃ©sactivÃ© sur les Ã©quipements Cisco. Il peut Ãªtre activÃ© ou dÃ©sactivÃ© globalement ou par interface.
### Activer/DÃ©sactiver LLDP globalement
- Pour activer LLDP globalement :
  ```ios
  Router(config)# lldp run
  ```
- Pour dÃ©sactiver LLDP globalement :
  ```ios
  Router(config)# no lldp run
  ```
### Activer/DÃ©sactiver LLDP sur une interface spÃ©cifique
- Pour activer LLDP sur une interface :
  ```ios
  Router(config)# interface GigabitEthernet0/1
  Router(config-if)# lldp transmit
  Router(config-if)# lldp receive
  ```
- Pour dÃ©sactiver LLDP sur une interface :
  ```ios
  Router(config)# interface GigabitEthernet0/1
  Router(config-if)# no lldp transmit
  Router(config-if)# no lldp receive
  ```
## VÃ©rification des informations LLDP
### Afficher les voisins LLDP
- La commande suivante permet d'afficher les Ã©quipements voisins dÃ©tectÃ©s :
  ```ios
  Router# show lldp neighbors
  ```
  >ğŸ’¡ Cette commande affiche des informations telles que l'ID du pÃ©riphÃ©rique, le port local, le port distant et le type de plateforme.
### Afficher les dÃ©tails des voisins LLDP
- Pour obtenir des informations plus dÃ©taillÃ©es sur un voisin spÃ©cifique :
  ```ios
  Router# show lldp neighbors detail
  ```
  >ğŸ’¡ Cette commande affiche des dÃ©tails supplÃ©mentaires comme l'adresse IP du voisin et le modÃ¨le du pÃ©riphÃ©rique.
## Configuration avancÃ©e de LLDP
### Modifier l'intervalle d'envoi des annonces LLDP
- L'intervalle par dÃ©faut est de **30 secondes**, mais il peut Ãªtre modifiÃ© :
  ```ios
  Router(config)# lldp timer 20
  ```
  >ğŸ’¡ Cette commande rÃ©duit l'intervalle Ã  20 secondes.
### Modifier le dÃ©lai avant suppression d'un voisin LLDP
- L'intervalle par dÃ©faut est de **120 secondes**, mais il peut Ãªtre modifiÃ© :
  ```ios
  Router(config)# lldp holdtime 90
  ```